//**********************************************************************************************************************
// Скрип для сохранения файлов с бинарными последовательностями
//**********************************************************************************************************************


import * as fs from 'fs';

// Функция, которая принимает буфер из единиц и нулей и сохраняет его в файл .bin
export function saveBinFile(buffer: Buffer, fileName: string) {
    fs.writeFile(fileName, buffer, {flag: 'a'}, (err) => {
        // Обрабатываем возможные ошибки
        if (err) {
            console.error(err);
            return;
        }
        console.log('Файл успешно записан!');
    });
}